#!/bin/bash

# 1. Создать файл file1 и наполнить его произвольным содержимым. 
# Скопировать его в file2. Создать символическую ссылку file3 на file1. 
# Создать жесткую ссылку file4 на file1. Посмотреть, какие айноды у файлов. Удалить file1. 
# Что стало с остальными созданными файлами? Попробовать вывести их на экран.1.

echo 'lorem ipsum' > file1;
cp file1 file2;
ln -s file1 file3;
ln -P file1 file4;
echo 'ls -ila';
ls -ila;
rm file1;
echo 'rm file1; ls - ila'
ls -ila;
cat file2 file3 file4;

# Файл 2 был скопирован с файла 1, соответсвенно хранится в отдельной ячейке памяти, без проблем вызывается.
# Файл 3 - символическая ссылка, не запускается, выдаёт ошибку, так как ссылается на файл 1, который был удалён
# Файл 4 - является жёсткой ссылкой файла 1, у них одинаковая айнода, соотетсвенно после удаления файла 1,
# доступ к ячейке памяти сохранился и файл 4 так же запускается. 
# Доступ пропадёт когда будут удалены все жёсткие ссылки
