#!/bin/bash

# 10. * Полезное задание на конвейер. 
# Использовать команду cut на вывод длинного списка каталога, 
# чтобы отобразить только права доступа к файлам. 
# Затем отправить в конвейере этот вывод на sort и uniq, 
# чтобы отфильтровать все повторяющиеся строки. 
# Потом с помощью wc посчитать различные типы разрешений в этом каталоге. 
# Самостоятельно решить задачу, как сделать так, 
# чтобы в подсчет не добавлялись строка Итого и файлы . и .. 
# (ссылки на текущую и родительскую директории)

chmod ugo+x task_10.sh;

ls -la | grep -wv '\.' | grep -wv 'итого' | cut -b 1-10 | sort | uniq | wc -l;
