# Задания:
# Установить VMWare Player/Virtualbox, установить Ubuntu.
# * Установить утилиты для гостевой ОС.
# Разобраться, что такое bash, используя справочные системы.
# Разобраться, как копировать и удалять файлы.
# * Установить mc и openssh-server.
# * Если вы работаете в Windows, установить PuTTY для подключения к виртуальной машине по ssh и подключиться.

sudo apt install mc;
sudo apt install openssh-server;
touch 111;
cp 111 333;
rm 111;

# Все задания выполнены, здесь демонстрация установки программ, создания, копирования, удаления файла через скрипт
